app/controllers/articles_controller.rb

      def create
        @article = Article.new(article_params)
        @article.save
---
INSERT INTO "articles" ("title", "user", "tech", "description", "resolution", "catagory", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["title", ""], ["user", ""], ["tech", ""], ["description", ""], ["resolution", ""], ["catagory", ""], ["created_at", "2018-04-11 21:02:03.526391"], ["updated_at", "2018-04-11 21:02:03.526391"]]