app/controllers/comments_controller.rb

INSERT INTO "comments" ("author_name", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author_name", ""], ["body", ""], ["article_id", 1], ["created_at", "2018-04-11 21:02:13.780959"], ["updated_at", "2018-04-11 21:02:13.780959"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.article_id = params[:article_id]
    @comment.save