app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    respond_to do |format|
      if @profile.save
---
INSERT INTO "profiles" ("username", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "admin"], ["email", "admin"], ["created_at", "2018-04-12 01:29:37.041404"], ["updated_at", "2018-04-12 01:29:37.041404"]]